In [144]:
import pandas as pd

In [145]:
df = pd.read_csv("C:\\Users\\Umeshyam\\Desktop\\file.csv", header=0)

In [146]:
df

   m0  m1  m2  m3  m4
0   1  44  56  67  68
1   2  44  56  87  68
2   3  45  56  67  46
3   1  45  56  87  36
4   2  46  56  67  40
5   3  46  55  87  41

In [147]:
data = []
for (idxRow, s1), (_, s2) in zip(df.iterrows(), df.iterrows()):
    for (idxCol, v1), (_, v2) in zip(s1.iteritems(), s2.iteritems()):
        if v1 != v2:
            data.extend([[idxRow,idxCol,v1,v2]])
            

print("differen values", data)

differen values []

In [135]:
data

[]

In [136]:
uniques = pd.unique(df[['m0']].values.ravel())

In [137]:
uniques

array([1, 2, 3], dtype=int64)

In [138]:
#To select rows whose column value equals a scalar, some_value, use ==:
idx_rows=[]
for i in uniques:
    idx_row = df.index[df['m0'] == i].tolist()
    idx_rows.append(idx_row)
    #print(df.loc[df['m0'] == i])

idx_rows

[[0, 3], [1, 4], [2, 5]]

In [149]:
dif_data = []
for i in idx_rows:
    for (idxCol, v1), (_, v2) in zip(df.loc[i[0]].iteritems(), df.loc[i[1]].iteritems()):
        if v1 != v2:
            dif_data.extend([[i[0],i[1],idxCol,v1,_,v2]])            
dif_data

[[0, 3, 'm1', 44, 'm1', 45],
 [0, 3, 'm3', 67, 'm3', 87],
 [0, 3, 'm4', 68, 'm4', 36],
 [1, 4, 'm1', 44, 'm1', 46],
 [1, 4, 'm3', 87, 'm3', 67],
 [1, 4, 'm4', 68, 'm4', 40],
 [2, 5, 'm1', 45, 'm1', 46],
 [2, 5, 'm2', 56, 'm2', 55],
 [2, 5, 'm3', 67, 'm3', 87],
 [2, 5, 'm4', 46, 'm4', 41]]

In [126]:
for i in idx_rows:
    pass
    #print(df.loc[i[0]],"\n",df.loc[i[1]])

In [130]:
data

{44: 87, 67: 45, 68: 56}

In [118]:
df

   m0  m1  m2  m3  m4
0   1  44  56  67  68
1   2  44  56  87  68
2   3  45  56  67  46
3   1  45  56  87  36
4   2  46  56  67  40
5   3  46  55  87  41

In [119]:
for i in uniques:
    print(df.loc[df['m0'] == i])

   m0  m1  m2  m3  m4
0   1  44  56  67  68
3   1  45  56  87  36
   m0  m1  m2  m3  m4
1   2  44  56  87  68
4   2  46  56  67  40
   m0  m1  m2  m3  m4
2   3  45  56  67  46
5   3  46  55  87  41

In [120]:
data

{44: 46, 67: 87, 68: 40, 87: 67, 45: 46, 56: 55, 46: 41}

In [152]:
df1 = pd.DataFrame(dif_data, columns=['Source_rowid', 'Desn_rowid','Sour_colname','Sou_Value','Target_cname','S_V'])

In [153]:
df1

   Source_rowid  Desn_rowid Sour_colname  Sou_Value Target_cname  S_V
0             0           3           m1         44           m1   45
1             0           3           m3         67           m3   87
2             0           3           m4         68           m4   36
3             1           4           m1         44           m1   46
4             1           4           m3         87           m3   67
5             1           4           m4         68           m4   40
6             2           5           m1         45           m1   46
7             2           5           m2         56           m2   55
8             2           5           m3         67           m3   87
9             2           5           m4         46           m4   41